function ShowAnswer(){
var date = new Date();
var number = date.getMilliseconds();
document.getElementById("AnswerBox").innerHTML=number;
}

function abc(){
  var A = [];
  A[0]=["ant",0, 0, 0];
  A[1]=["bat",0, 0, 1];
  A[2]=["cat",0, 1, 0];
  A[3]=["dog",0, 1, 1];
  A[4]=["egg",1, 0, 0];
  A[5]=["fog",1, 0, 1];
  A[6]=["gem",1, 1, 0];
  A[7]=["hat",1, 1, 1];
  var B=[];
  B=[0,0,0,0,0,0,0,0];
  var obj=document.getElementsByName("test");
if (obj[0].checked == true){
  for(i=0;i<8;i++){
			if(A[i][1]==1){B[i]+=1;}
			}
   }
if (obj[1].checked == true){for(i=0;i<8;i++){
			if(A[i][2]==1){
			B[i]+=1;
			}
			}
    }
if (obj[2].checked == true){for(i=0;i<8;i++){
			if(A[i][3]==1){
			B[i]+=1;
			}
			}
}
var kk=0;
var C=[];
for(i=0;i<8;i++){if(B[i]>0){
	C[kk]=A[i][0];
	kk=kk+1;}
}

document.getElementById("Testabc").innerHTML=C;
}



function Search(){	
var A = [];	
A[0]=["小邁時光",1,1,1,0];
A[1]=["菇雞",0,1,1,0];
A[2]=["小虎",0,0,1,0];
A[3]=["九州",0,0,1,0];
A[4]=["阿旻",0,1,1,0];
A[5]=["紅樓",0,1,0,0];
A[6]=["大夯",0,0,1,0];
A[7]=["元味屋",0,1,0,0];
A[8]=["樂品屋",0,1,0,0];
A[9]=["小赤佬",0,0,1,1];
A[10]=["大醬",0,1,1,0];
A[11]=["煦悅",0,1,1,0];
A[12]=["紅記早點",0,0,0,1];
A[13]=["一點刈包",0,0,0,1];
A[14]=["黑色香蕉",0,0,0,1];
A[15]=["小茂屋",0,1,1,0];
A[16]=["心之初",0,0,1,0];
A[17]=["神戶廚房",0,1,1,0];
A[18]=["御鍋燒",0,0,1,0];
A[19]=["嚐仙",0,0,0,1];
A[20]=["黑工號",0,0,0,1];
A[21]=["喬貝克",0,1,1,0];
A[22]=["肉肉控",0,1,0,0];
A[23]=["鹿杯",0,1,1,0];
A[24]=["阿堡",1,0,0,0];
A[25]=["麥當勞",0,1,0,1];
A[26]=["四海遊龍",0,1,0,0];
A[27]=["櫻之庭",0,1,0,0];
A[28]=["佳味庭",0,1,0,0];
A[29]=["紅番茄",0,1,1,0];
A[30]=["顏舍",0,1,1,0];
A[31]=["刀削冰",0,0,0,1];
A[32]=["享受",0,0,1,0];
A[33]=["簡單",0,1,1,0];
A[34]=["好煮義",0,1,1,0];
A[35]=["上樂",0,1,0,0];
A[36]=["肯德基",0,1,1,1];
A[37]=["三商巧福",0,1,1,0];
A[38]=["不要吃",1,1,1,1];
A[39]=["老友",0,1,1,0];
A[40]=["良晨吉食",1,0,0,0];
A[41]=["廣越",0,1,1,0];
A[42]=["阿珠媽",0,1,1,0];
A[43]=["食神廣東粥",0,1,0,0];
A[44]=["奧莉微",0,1,1,0];
A[45]=["加依軒",0,1,1,0];
A[46]=["紅豆",1,0,0,0];
A[47]=["余家刀削麵",0,0,1,0];
A[48]=["港式燒臘",0,1,1,0];
A[49]=["老邱早餐",1,0,0,0];
A[50]=["IS義式餐廳",0,1,0,0];
A[51]=["湯師傅",0,1,0,0];
A[52]=["路易沙",0,0,0,1];
A[53]=["波哥",0,1,0,1];
A[54]=["少爺蛋餅",1,0,0,0];
A[55]=["便利商店",1,1,0,1];
A[56]=["醫餐",1,1,0,1];
A[57]=["牛伯",0,1,0,0];
A[58]=["早安山丘",1,0,0,0];
A[59]=["食神滷味",0,0,0,1];	
var B=[];
for(i=0;i<60;i++){
B[i]=0;
}	
var obj=document.getElementsByName("food");
if (obj[0].checked == true){for(i=0;i<60;i++){
			if(A[i][1]==1){
				B[i]+=1;
				}
			}
	}
if (obj[1].checked == true){for(i=0;i<60;i++){
			if(A[i][2]==1){
				B[i]+=1;
				}
			}
	}
if (obj[2].checked == true){for(i=0;i<8;i++){
			if(A[i][3]==1){
				B[i]+=1;
				}
			}
	}
if (obj[3].checked == true){for(i=0;i<60;i++){
			if(A[i][4]==1){
			B[i]+=1;
			}
			}
}
var kk=0;
var C=[];
for(i=0;i<60;i++){if(B[i]>0){
	C[kk]=A[i][0];
	kk=kk+1;}
	}
var date = new Date();
var number = date.getMilliseconds();
var choice = number % C.length;
	
	
document.getElementById("Eat").innerHTML=C[choice];
}	


